[
    {
        "id": 1,
        "title": "Nega blog yozishni boshladim?",
        "content": "Salom!Bu mening birinchi blogim.O'zi nega blog yozishni boshladim?Buning sabablari ko'p: \n 1.Menga portfolio uchun real loyiha kerak edi \n 2.Esda qolarli voqealani yozib qo'yish \n 3.Fikrlarimni boshqlar bilan bo'lishish \n 4.Yozish mahoratini oshirish \n 5.Sherlok Xolms \n\n Hozir tushuntirib beraman \n Dasturchilik mahoratinimni oshirish uchun menga real loyihalar kerak bo'ladi va ishga kirmoqchi bo'lganimda ham real loyihalar so'raladi.\n\n Esda qolarli voqealarni yozib qo'yish va keyinchalik eslash uchun, misol uchun yaqinda daturlashdan hackathonga qatnashganimiz,universitetdagi qiziqarli va ahmoqona narsalar va h.k lar haqida yozib borish menga qiziq tuyulgan. Buni telegramda ham qilishim mumkin edi lekin u juda oddiy ko'rindi va 1-sabab ham bor.Shuning uchun web site qilish yaxshiroq deb o'yladim.\n\n Fikrlarimni boshqalar bilan bo'lishgim keldi(\"menga qiziqmas\" deydiganlardan boshqalarga).Misol uchun ko'rgan kinolarim,qo'shiqlarim haqida yangi o'rgangan narlarim, meni qiziqtirgan savollar haqida yozgim keldi.\n\n Gaplar chiroyli chiqmayotgan bo'lsa uzr, hali so'z boyligim kam va bu endi birinchi blog.Keyinchalik ko'proq yozib fikrlarimni yozma tarzda chiroyli yetkazishni o'rganishim kerak. \n\n Sherlok Xolmsning nima aloqasi bor? Yaqinda Sherlok Xolms(BBC Sherlock) serialini ko'rgandim,agar ko'rgan bo'lgangiz unda Dr.Watson o'zining blogida Sherlok Xolms bilan fosh qilgan jinoyatlarni detektiv hikoya sifatida yozib boradi.Bu menga ham qiziq tuyuldi.\n\n Hozircha shunaqa gaplar...",
        "date": "15 may 2025"
    },
    {
        "id": 2,
        "title": "Birinchi hackathon (yoki hakaton)",
        "content": "Yaqinda,aniqrog'i 6-mayda universitetimizda Ipak Yuli bank va Paynet tomonidan o'tkazilgan hakatonda kursdoshlarim bilan qatnashdik.Hackathon(hack+marathon=hackathon) nimaligini qisqacha tushuntirib beraman,hullas siz 24 yoki 48 soat ichida qandaydir muammoni hal qiladigan loyihalar ishlab chiqishingiz kerak bo'ladi, bunda siz jamoviy qatnashasiz.Lekin bizda boshqacharoq bo'ldi.1 hafta oldin berilgandi(balki undan ham ko'proqdir) va hakatonga tayyor loyiha bilab kelib uni taqdimotini qilib berish kerak edi.\n\nBiz oldingi bank ma'lumotlaridan foydalanib kelajakda bankka qancha kartalar uchun arizalar kelib tushishini aniqlab beradigan dastur qilmoqchi edik,bu ideani ustozimiz taklif qildi.Biz buni deyarli uddaladik desam ham bo'ladi,to'g'risini aytganda loyihani o'zimiz o'ylaganchalik zo'r qilib ishlab chiqishga aqlimiz yetmadi.\n\nLoyiha ustida ishlashni hakatondan 1 kun oldi boshladik,o'sha kuni kechki payt universitetdan chiqib mening kvartiramga kelib tunda uxlamasdan ishlab chiqdik. Jamoamizda 4 nafar ishtirokchi bor edi, ulardan biri men.Ikkita og'aynim prezentatsiyaning so'zlari,loyiha mazmunini ochib berish ustida yana bittasi malumotlar bazasi va algoritmlar ustida ishladi men esa loyihaning dizayni,web sitening frontend va backendini qildim.Hullas tunda uxlamasdan loyihani chalaroq qilib bo'lsa ham tayyorladik.\n\n Biz o'rin ola olganimiz yo'q, ammo eng asosisi jamoa bo'lib ishlab 1 kunda shuncha narsalar qildik,tajriba oldik.Men backend haqida umuman tushuncham bo'lmay turib chatGPTdan o'rganib saytni ishlata oldim va hozir blog saytni ham shu o'rgan narsalarim bo'yicha qildim.\n\nHa aytgancha hakaton go'liblari uchun umumiy sovrin 26 mln so'm edi.",
        "date": "19 may 2025"
    }
]